---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScaleFailures.CannotScaleLinkWithSharedCoordinates
source: html/9bde931e-e887-3b17-9f89-d297e1a077f1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScaleFailures.CannotScaleLinkWithSharedCoordinates Property

Can't scale link that shares coordinates with host model

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotScaleLinkWithSharedCoordinates { get; }
```